tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- SYS_CLK_CTRL_0_CM4: Control Settings for CLK0 - Cortex M4 Clock -->
        <register>
          <name>SYS_CLK_CTRL_0_CM4</name>
          <description>Control Settings for CLK0 - Cortex M4 Clock</description>
          <addressOffset>0x0040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>cm4_clk_scale</name>
              <description>Control Settings for CLK0 - Cortex M4 Clock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_1_SYNC: Control Settings for CLK1 - Synchronizer Clock -->
        <register>
          <name>SYS_CLK_CTRL_1_SYNC</name>
          <description>Control Settings for CLK1 - Synchronizer Clock</description>
          <addressOffset>0x0044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>sync_clk_scale</name>
              <description>Control Settings for CLK1 - Synchronizer Clock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_2_SPIX: Control Settings for CLK2 - SPI XIP Clock -->
        <register>
          <name>SYS_CLK_CTRL_2_SPIX</name>
          <description>Control Settings for CLK2 - SPI XIP Clock</description>
          <addressOffset>0x0048</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>spix_clk_scale</name>
              <description>Control Settings for CLK2 - SPI XIP Clock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_3_PRNG: Control Settings for CLK3 - PRNG Clock -->
        <register>
          <name>SYS_CLK_CTRL_3_PRNG</name>
          <description>Control Settings for CLK3 - PRNG Clock</description>
          <addressOffset>0x004C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>prng_clk_scale</name>
              <description>Control Settings for CLK3 - PRNG Clock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_4_WDT0: Control Settings for CLK4 - Watchdog Timer 0 -->
        <register>
          <name>SYS_CLK_CTRL_4_WDT0</name>
          <description>Control Settings for CLK4 - Watchdog Timer 0</description>
          <addressOffset>0x0050</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>watchdog0_clk_scale</name>
              <description>Control Settings for CLK4 - Watchdog Timer 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_5_WDT1: Control Settings for CLK5 - Watchdog Timer 1 -->
        <register>
          <name>SYS_CLK_CTRL_5_WDT1</name>
          <description>Control Settings for CLK5 - Watchdog Timer 1</description>
          <addressOffset>0x0054</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>watchdog1_clk_scale</name>
              <description>Control Settings for CLK5 - Watchdog Timer 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_6_GPIO: Control Settings for CLK6 - Clock for GPIO Ports -->
        <register>
          <name>SYS_CLK_CTRL_6_GPIO</name>
          <description>Control Settings for CLK6 - Clock for GPIO Ports</description>
          <addressOffset>0x0058</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>gpio_clk_scale</name>
              <description>Control Settings for CLK6 - Clock for GPIO Ports</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_7_PT: Control Settings for CLK7 - Source Clock for All Pulse Trains -->
        <register>
          <name>SYS_CLK_CTRL_7_PT</name>
          <description>Control Settings for CLK7 - Source Clock for All Pulse Trains</description>
          <addressOffset>0x005C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pulse_train_clk_scale</name>
              <description>Control Settings for CLK7 - Source Clock for All Pulse Trains</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- SYS_CLK_CTRL_8_UART: Control Settings for CLK8 - Source Clock for All UARTs -->
        <register>
          <name>SYS_CLK_CTRL_8_UART</name>
          <description>Control Settings for CLK8 - Source Clock for All UARTs</description>
          <addressOffset>0x0060</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>uart_clk_scale</name>
              <description>Control Settings for CLK8 - Source Clock for All UARTs</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

