tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- WUD_CTRL: Wake-Up Detect Control -->
        <register>
          <name>WUD_CTRL</name>
          <description>Wake-Up Detect Control</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pad_select</name>
              <description>Wake-Up Pad Select</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pad_mode</name>
              <description>Wake-Up Pad Signal Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>clear_all</name>
              <description>Clear All WUD Pad States</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ctrl_enable</name>
              <description>Enable WUD Control Modification</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- WUD_PULSE0: WUD Pulse To Mode Bit 0 -->
        <register>
          <name>WUD_PULSE0</name>
          <description>WUD Pulse To Mode Bit 0</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
        </register>

        <!-- WUD_PULSE1: WUD Pulse To Mode Bit 1 -->
        <register>
          <name>WUD_PULSE1</name>
          <description>WUD Pulse To Mode Bit 1</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
        </register>

        <!-- WUD_SEEN0: Wake-up Detect Status for P0/P1/P2/P3 -->
        <register>
          <name>WUD_SEEN0</name>
          <description>Wake-up Detect Status for P0/P1/P2/P3</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>gpio0</name>
              <description>Wake-Up Detect Status for P0.0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio1</name>
              <description>Wake-Up Detect Status for P0.1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio2</name>
              <description>Wake-Up Detect Status for P0.2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio3</name>
              <description>Wake-Up Detect Status for P0.3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio4</name>
              <description>Wake-Up Detect Status for P0.4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio5</name>
              <description>Wake-Up Detect Status for P0.5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio6</name>
              <description>Wake-Up Detect Status for P0.6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio7</name>
              <description>Wake-Up Detect Status for P0.7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio8</name>
              <description>Wake-Up Detect Status for P1.0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio9</name>
              <description>Wake-Up Detect Status for P1.1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio10</name>
              <description>Wake-Up Detect Status for P1.2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio11</name>
              <description>Wake-Up Detect Status for P1.3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio12</name>
              <description>Wake-Up Detect Status for P1.4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio13</name>
              <description>Wake-Up Detect Status for P1.5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio14</name>
              <description>Wake-Up Detect Status for P1.6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio15</name>
              <description>Wake-Up Detect Status for P1.7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio16</name>
              <description>Wake-Up Detect Status for P2.0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio17</name>
              <description>Wake-Up Detect Status for P2.1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio18</name>
              <description>Wake-Up Detect Status for P2.2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio19</name>
              <description>Wake-Up Detect Status for P2.3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio20</name>
              <description>Wake-Up Detect Status for P2.4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio21</name>
              <description>Wake-Up Detect Status for P2.5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio22</name>
              <description>Wake-Up Detect Status for P2.6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio23</name>
              <description>Wake-Up Detect Status for P2.7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio24</name>
              <description>Wake-Up Detect Status for P3.0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio25</name>
              <description>Wake-Up Detect Status for P3.1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio26</name>
              <description>Wake-Up Detect Status for P3.2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio27</name>
              <description>Wake-Up Detect Status for P3.3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio28</name>
              <description>Wake-Up Detect Status for P3.4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio29</name>
              <description>Wake-Up Detect Status for P3.5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio30</name>
              <description>Wake-Up Detect Status for P3.6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio31</name>
              <description>Wake-Up Detect Status for P3.7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- WUD_SEEN1: Wake-up Detect Status for P4/P5/P6/P7 -->
        <register>
          <name>WUD_SEEN1</name>
          <description>Wake-up Detect Status for P4/P5/P6/P7</description>
          <addressOffset>0x0020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>gpio32</name>
              <description>Wake-Up Detect Status for P4.0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio33</name>
              <description>Wake-Up Detect Status for P4.1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio34</name>
              <description>Wake-Up Detect Status for P4.2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio35</name>
              <description>Wake-Up Detect Status for P4.3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio36</name>
              <description>Wake-Up Detect Status for P4.4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio37</name>
              <description>Wake-Up Detect Status for P4.5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio38</name>
              <description>Wake-Up Detect Status for P4.6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio39</name>
              <description>Wake-Up Detect Status for P4.7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio40</name>
              <description>Wake-Up Detect Status for P5.0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio41</name>
              <description>Wake-Up Detect Status for P5.1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio42</name>
              <description>Wake-Up Detect Status for P5.2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio43</name>
              <description>Wake-Up Detect Status for P5.3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio44</name>
              <description>Wake-Up Detect Status for P5.4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio45</name>
              <description>Wake-Up Detect Status for P5.5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio46</name>
              <description>Wake-Up Detect Status for P5.6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio47</name>
              <description>Wake-Up Detect Status for P5.7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>gpio48</name>
              <description>Wake-Up Detect Status for P6.0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- MARGIN_CTRL: SRAM Margin Adjustment -->
        <register>
          <name>MARGIN_CTRL</name>
          <description>SRAM Margin Adjustment</description>
          <addressOffset>0x0034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>extra_margin</name>
              <description>Extra Margin Adjustment</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>extra_write_margin</name>
              <description>Extra Write Margin Adjustment</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>write_assist_en</name>
              <description>Write Assist Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>write_assist_margin</name>
              <description>Write Assist Margin Adjustment</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- DIE_TYPE: Die Type ID Register -->
        <register>
          <name>DIE_TYPE</name>
          <description>Die Type ID Register</description>
          <addressOffset>0x0038</addressOffset>
          <access>read-write</access>
        </register>

