tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- REG3: Power Sequencer Control Register 3 -->
        <register>
          <name>REG3</name>
          <description>Power Sequencer Control Register 3</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_rosel</name>
              <description>Relaxation Oscillator Stable Timeout</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_fltrrosel</name>
              <description>Window of time power must be valid before entering Run mode.</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_svm_clk_mux</name>
              <description>SVM Clock Mux</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_ro_clk_mux</name>
              <description>Relaxation Clock Mux</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_failsel</name>
              <description>Timeout before rebooting during PowerFail/BootFail events.</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- REG4: Power Sequencer Control Register 4 (Internal Test Only) -->
        <register>
          <name>REG4</name>
          <description>Power Sequencer Control Register 4 (Internal Test Only)</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_tm_ps_2_gpio</name>
              <description>Internal Use Only</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_tm_fast_timers</name>
              <description>Internal Use Only</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_usb_dis_comp</name>
              <description>Internal Use Only</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_ro_tstclk_en</name>
              <description>Internal Use Only</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_nr_clk_gate_en</name>
              <description>Internal Use Only</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_ext_clk_in_en</name>
              <description>Internal Use Only</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_pseq_32k_en</name>
              <description>Internal Use Only</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- REG5: Power Sequencer Control Register 5 (Trim 0) -->
        <register>
          <name>REG5</name>
          <description>Power Sequencer Control Register 5 (Trim 0)</description>
          <addressOffset>0x0014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_trim_svm_bg</name>
              <description>Power Manager Bandgap trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_trim_bias</name>
              <description>Power Manager Bias Current trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[14:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_trim_retreg</name>
              <description>Retention Regulator trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_rtc_trim</name>
              <description>Real Time Clock trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- REG6: Power Sequencer Control Register 6 (Trim 1) -->
        <register>
          <name>REG6</name>
          <description>Power Sequencer Control Register 6 (Trim 1)</description>
          <addressOffset>0x0018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_trim_usb_bias</name>
              <description>USB Bias Current trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_trim_usb_pm_res</name>
              <description>USB Data Plus Slew Rate trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_trim_usb_dm_res</name>
              <description>USB Data Minus Slew Rate trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_trim_osc_vref</name>
              <description>Relaxation Oscillator trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pwr_trim_crypto_osc</name>
              <description>Crypto Oscillator trim setting</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- REG7: Power Sequencer Control Register 7 -->
        <register>
          <name>REG7</name>
          <description>Power Sequencer Control Register 7</description>
          <addressOffset>0x001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pwr_flash_pd_lookahead</name>
              <description>Flash Powerdown Lookahead Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

