tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- SPIB_ACK: SPI Bridge I/O Mode Acknowledge -->
        <register>
          <name>SPIB_ACK</name>
          <description>SPI Bridge I/O Mode Acknowledge</description>
          <addressOffset>0x008C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>core_io_ack</name>
              <description>SPI Bridge Core I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>quad_io_ack</name>
              <description>SPI Bridge Quad I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>fast_mode</name>
              <description>SPI Bridge Fast Mode Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- OWM_REQ: 1-Wire Master I/O Mode Request -->
        <register>
          <name>OWM_REQ</name>
          <description>1-Wire Master I/O Mode Request</description>
          <addressOffset>0x0090</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_req</name>
              <description>1-Wire Line I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>epu_io_req</name>
              <description>External Pullup Control Line I/O Request</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- OWM_ACK: 1-Wire Master I/O Mode Acknowledge -->
        <register>
          <name>OWM_ACK</name>
          <description>1-Wire Master I/O Mode Acknowledge</description>
          <addressOffset>0x0094</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>mapping_ack</name>
              <description>1-Wire Line I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>epu_io_ack</name>
              <description>External Pullup Control Line I/O Acknowledge</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>


    <!-- FLC:FLC -->

    <peripheral>
      <name>FLC</name>
      <description>Flash Controller</description>
      <!-- <groupName>FLC</groupName> -->
      <baseAddress>0x40002000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLC</name>
        <value>2</value>
        <description>Flash Controller IRQ</description>
      </interrupt>
      <registers>

        <!-- FADDR: Flash Operation Address  -->
        <register>
          <name>FADDR</name>
          <description>Flash Operation Address </description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>faddr</name>
              <description>Flash Operation Address</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- FCKDIV: Flash Clock Pulse Divisor -->
        <register>
          <name>FCKDIV</name>
          <description>Flash Clock Pulse Divisor</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>fckdiv</name>
              <description>Flash Clock Pulse Divisor</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>auto_fckdiv_result</name>
              <description>Auto FCKDIV Calculation Result</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- CTRL: Flash Control Register -->
        <register>
          <name>CTRL</name>
          <description>Flash Control Register</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>write</name>
              <description>Start Flash Write Operation</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mass_erase</name>
              <description>Start Flash Mass Erase Operation</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>page_erase</name>
              <description>Start Flash Page Erase Operation</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>erase_code</name>
              <description>Flash Erase Code</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>info_block_unlock</name>
              <description>Flash Info Block Locked</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>write_enable</name>
              <description>Flash Writes Enabled</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>pending</name>
              <description>Flash Controller Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>info_block_valid</name>
              <description>Info Block Valid Status</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>auto_incre_mode</name>
              <description>Address Auto-Increment Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>flsh_unlock</name>
              <description>Flash Write/Erase Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INTR: Flash Controller Interrupt Flags and Enable/Disable 0 -->
        <register>
          <name>INTR</name>
          <description>Flash Controller Interrupt Flags and Enable/Disable 0</description>
          <addressOffset>0x0024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>finished_if</name>
              <description>Flash Write/Erase Operation Finished</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>failed_if</name>
              <description>Flash Operation Failed</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>finished_ie</name>
              <description>Flash Write/Erase Operation Finished Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>failed_ie</name>
              <description>Flash Operation Failed Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fail_flags</name>
              <description>Flash Operation Failure Details</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

