tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- FDATA: Flash Operation Data Register -->
        <register>
          <name>FDATA</name>
          <description>Flash Operation Data Register</description>
          <addressOffset>0x0030</addressOffset>
          <access>read-write</access>
        </register>

        <!-- PERFORM: Flash Performance Settings -->
        <register>
          <name>PERFORM</name>
          <description>Flash Performance Settings</description>
          <addressOffset>0x0050</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>delay_se_en</name>
              <description>Delay SE Enable (Deprecated)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>fast_read_mode_en</name>
              <description>Fast Read Mode Enable (Deprecated)</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_prevent_fail</name>
              <description>Prevent Fail Flag Set on FLC Busy</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_back2back_rds</name>
              <description>Enable Back To Back Reads</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_back2back_wrs</name>
              <description>Enable Back To Back Writes</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>en_merge_grab_gnt</name>
              <description>Enable Merge Grab GNT</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>auto_tacc</name>
              <description>Auto TACC</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>auto_clkdiv</name>
              <description>Auto CLKDIV</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- TACC: Flash Read Cycle Config -->
        <register>
          <name>TACC</name>
          <description>Flash Read Cycle Config</description>
          <addressOffset>0x0054</addressOffset>
          <access>read-write</access>
        </register>

        <!-- TPROG: Flash Write Cycle Config -->
        <register>
          <name>TPROG</name>
          <description>Flash Write Cycle Config</description>
          <addressOffset>0x0058</addressOffset>
          <access>read-write</access>
        </register>

        <!-- STATUS: Security Status Flags -->
        <register>
          <name>STATUS</name>
          <description>Security Status Flags</description>
          <addressOffset>0x0080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>jtag_lock_window</name>
              <description>Debug Locked - Hardware Window</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>jtag_lock_static</name>
              <description>Debug Locked - Firmware Lockout</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>auto_lock</name>
              <description>Debug Locked - Auto Lock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>trim_update_done</name>
              <description>Trim Update Done</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>info_block_valid</name>
              <description>Info Block Valid</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- SECURITY: Flash Controller Security Settings -->
        <register>
          <name>SECURITY</name>
          <description>Flash Controller Security Settings</description>
          <addressOffset>0x0088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>debug_disable</name>
              <description>Debug Lockout</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>mass_erase_lock</name>
              <description>Mass Erase Lockout</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>disable_ahb_wr</name>
              <description>Disable AHB Flash Write Operations</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>flc_settings_lock</name>
              <description>FLC Settings Lock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>security_lock</name>
              <description>Security Lock</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- BYPASS: Status Flags for DSB Operations -->
        <register>
          <name>BYPASS</name>
          <description>Status Flags for DSB Operations</description>
          <addressOffset>0x009C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>destruct_bypass_erase</name>
              <description>Destructive Security Bypass In Progress</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>superwipe_erase</name>
              <description>Superwipe Erase In Progress</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>destruct_bypass_complete</name>
              <description>Destructive Security Bypass Erase Complete</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>superwipe_complete</name>
              <description>Superwipe Erase Complete</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- USER_OPTION: Used to set DSB Access code and Auto-Lock in info block -->
        <register>
          <name>USER_OPTION</name>
          <description>Used to set DSB Access code and Auto-Lock in info block</description>
          <addressOffset>0x0100</addressOffset>
          <access>read-write</access>
        </register>

        <!-- CTRL2: Flash Control Register 2 -->
        <register>
          <name>CTRL2</name>
          <description>Flash Control Register 2</description>
          <addressOffset>0x0140</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>flash_lve</name>
              <description>Flash LVE Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>bypass_ahb_fail</name>
              <description>AHB Fail Bypass</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- INTFL1: Interrupt Flags Register 1 -->
        <register>
          <name>INTFL1</name>
          <description>Interrupt Flags Register 1</description>
          <addressOffset>0x0144</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>sram_addr_wrapped</name>
              <description>SRAM Address Wrapped Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>invalid_flash_addr</name>
              <description>Invalid Flash Address Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>flash_read_locked</name>
              <description>Flash Read from Locked Area Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>trim_update_done</name>
              <description>Trim Update Complete Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>flc_state_done</name>
              <description>FLC State Machine Reached DONE Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>flc_prog_complete</name>
              <description>Program (Write or Erase) Operation Completed Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

