tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- BUF_OVR_INT: USB Buffer Overflow Interrupt -->
        <register>
          <name>BUF_OVR_INT</name>
          <description>USB Buffer Overflow Interrupt</description>
          <addressOffset>0x0240</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>buf_ovr0</name>
              <description>Endpoint 0 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr1</name>
              <description>Endpoint 1 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr2</name>
              <description>Endpoint 2 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr3</name>
              <description>Endpoint 3 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr4</name>
              <description>Endpoint 4 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr5</name>
              <description>Endpoint 5 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr6</name>
              <description>Endpoint 6 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>buf_ovr7</name>
              <description>Endpoint 7 Buffer Overflow Interrupt Flag</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- SETUP0: USB SETUP Packet Bytes 0 to 3 -->
        <register>
          <name>SETUP0</name>
          <description>USB SETUP Packet Bytes 0 to 3</description>
          <addressOffset>0x0260</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>byte0</name>
              <description>SETUP Packet Byte 0</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>byte1</name>
              <description>SETUP Packet Byte 1</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>byte2</name>
              <description>SETUP Packet Byte 2</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>byte3</name>
              <description>SETUP Packet Byte 3</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- SETUP1: USB SETUP Packet Bytes 4 to 7 -->
        <register>
          <name>SETUP1</name>
          <description>USB SETUP Packet Bytes 4 to 7</description>
          <addressOffset>0x0264</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>byte4</name>
              <description>SETUP Packet Byte 4</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>byte5</name>
              <description>SETUP Packet Byte 5</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>byte6</name>
              <description>SETUP Packet Byte 6</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>byte7</name>
              <description>SETUP Packet Byte 7</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- EP0: USB Endpoint 0 Control Register -->
        <register>
          <name>EP0</name>
          <description>USB Endpoint 0 Control Register</description>
          <addressOffset>0x0280</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ep_dir</name>
              <description>Endpoint Direction</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_buf2</name>
              <description>Endpoint Double Buffered Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_int_en</name>
              <description>Endpoint Transfer Complete Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_nak_en</name>
              <description>Endpoint NAK Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_dt</name>
              <description>Endpoint Data Toggle Clear</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_stall</name>
              <description>Endpoint Stall</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_stall</name>
              <description>Endpoint Stall Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_ack</name>
              <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- EP1: USB Endpoint 1 Control Register -->
        <register>
          <name>EP1</name>
          <description>USB Endpoint 1 Control Register</description>
          <addressOffset>0x0284</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ep_dir</name>
              <description>Endpoint Direction</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_buf2</name>
              <description>Endpoint Double Buffered Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_int_en</name>
              <description>Endpoint Transfer Complete Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_nak_en</name>
              <description>Endpoint NAK Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_dt</name>
              <description>Endpoint Data Toggle Clear</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_stall</name>
              <description>Endpoint Stall</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_stall</name>
              <description>Endpoint Stall Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_ack</name>
              <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

