tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- EP2: USB Endpoint 2 Control Register -->
        <register>
          <name>EP2</name>
          <description>USB Endpoint 2 Control Register</description>
          <addressOffset>0x0288</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ep_dir</name>
              <description>Endpoint Direction</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_buf2</name>
              <description>Endpoint Double Buffered Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_int_en</name>
              <description>Endpoint Transfer Complete Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_nak_en</name>
              <description>Endpoint NAK Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_dt</name>
              <description>Endpoint Data Toggle Clear</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_stall</name>
              <description>Endpoint Stall</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_stall</name>
              <description>Endpoint Stall Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_ack</name>
              <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- EP3: USB Endpoint 3 Control Register -->
        <register>
          <name>EP3</name>
          <description>USB Endpoint 3 Control Register</description>
          <addressOffset>0x028C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ep_dir</name>
              <description>Endpoint Direction</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_buf2</name>
              <description>Endpoint Double Buffered Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_int_en</name>
              <description>Endpoint Transfer Complete Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_nak_en</name>
              <description>Endpoint NAK Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_dt</name>
              <description>Endpoint Data Toggle Clear</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_stall</name>
              <description>Endpoint Stall</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_stall</name>
              <description>Endpoint Stall Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_ack</name>
              <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- EP4: USB Endpoint 4 Control Register -->
        <register>
          <name>EP4</name>
          <description>USB Endpoint 4 Control Register</description>
          <addressOffset>0x0290</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ep_dir</name>
              <description>Endpoint Direction</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_buf2</name>
              <description>Endpoint Double Buffered Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_int_en</name>
              <description>Endpoint Transfer Complete Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_nak_en</name>
              <description>Endpoint NAK Interrupt Enable</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_dt</name>
              <description>Endpoint Data Toggle Clear</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_stall</name>
              <description>Endpoint Stall</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_stall</name>
              <description>Endpoint Stall Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ep_st_ack</name>
              <description>Endpoint Acknowledge Status Stage of Control Transfer</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

