tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- IN_MODE_P4: Port P4 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P4</name>
          <description>Port P4 GPIO Input Monitoring Mode</description>
          <addressOffset>0x0150</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P4.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P4.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P4.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P4.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P4.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P4.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P4.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P4.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_MODE_P5: Port P5 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P5</name>
          <description>Port P5 GPIO Input Monitoring Mode</description>
          <addressOffset>0x0154</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P5.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P5.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P5.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P5.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P5.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P5.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P5.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P5.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_MODE_P6: Port P6 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P6</name>
          <description>Port P6 GPIO Input Monitoring Mode</description>
          <addressOffset>0x0158</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P6.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P6.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P6.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P6.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P6.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P6.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P6.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P6.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <!-- IN_MODE_P7: Port P7 GPIO Input Monitoring Mode -->
        <register>
          <name>IN_MODE_P7</name>
          <description>Port P7 GPIO Input Monitoring Mode</description>
          <addressOffset>0x015C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>pin0</name>
              <description>P7.0 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin1</name>
              <description>P7.1 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin2</name>
              <description>P7.2 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin3</name>
              <description>P7.3 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin4</name>
              <description>P7.4 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin5</name>
              <description>P7.5 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin6</name>
              <description>P7.6 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>pin7</name>
              <description>P7.7 Input Monitoring Mode</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

