tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/max32630.svd
        <!-- FIFO_CTRL: SPI Slave FIFO Control Register -->
        <register>
          <name>FIFO_CTRL</name>
          <description>SPI Master FIFO Control Register</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_fifo_ae_lvl</name>
              <description>Transaction FIFO Almost Empty Flag Level</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_af_lvl</name>
              <description>Receive FIFO Almost Full Flag Level</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[12:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- FIFO_STAT: SPI Slave FIFO Status Register -->
        <register>
          <name>FIFO_STAT</name>
          <description>SPI Slave FIFO Status Information</description>
          <addressOffset>0x0008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_fifo_used</name>
              <description>Number of Bytes in Transmit FIFO</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_fifo_used</name>
              <description>Number of Bytes in Receive FIFO</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <!-- INTFL: SPI Slave Interrupt Flags -->
        <register>
          <name>INTFL</name>
          <description>SPI Slave Interrupt Flags</description>
          <addressOffset>0x000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_fifo_ae</name>
              <description>TX FIFO Almost Empty</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_fifo_af</name>
              <description>RX FIFO Almost Full</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>tx_no_data</name>
              <description>TX FIFO Empty</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>rx_lost_data</name>
              <description>RX FIFO Overflow</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ss_asserted</name>
              <description>Slave Select Asserted</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ss_deasserted</name>
              <description>Slave Select Deasserted</description>
              <enumeratedValues></enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>

        <!-- INTEN: SPI Slave Interrupt Enable/Disable Settings -->
        <register>
          <name>INTEN</name>
          <description>SPI Slave Interrupt Enable/Disable Settings</description>
          <addressOffset>0x0010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>tx_fifo_ae</name>
              <description>TX FIFO Almost Empty Int Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_fifo_af</name>
              <description>RX FIFO Almost Full Int Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_no_data</name>
              <description>No Data in TX FIFO Int Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_lost_data</name>
              <description>RX FIFO Overflow Int Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_underflow</name>
              <description>TX Underflow Int Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss_asserted</name>
              <description>Slave Select Asserted Int Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ss_deasserted</name>
              <description>Slave Select Deasserted Int Enable</description>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>

      </registers>
    </peripheral>
  </peripherals>
</device>
